## Plan Result (sbox_landing - TerraformPlanApply)




<pre><code>Plan: 301 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-User-Owner-Isabella.O&#39;Hara@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-User-Owner-prasanna.krishnan@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-User-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-logic-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-User-Owner-Isabella.O&#39;Hara@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-User-Owner-prasanna.krishnan@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-User-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-main-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-User-Owner-Isabella.O&#39;Hara@HMCTS.NET&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-User-Owner-prasanna.krishnan@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-User-Owner-qiang.zhou@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;02-ingest02-network-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;02&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_access_policy.logging_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta001&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;02&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;02&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;02&#34;].azurerm_monitor_diagnostic_setting.runtimes_datafactory
  * module.data_landing_zone[&#34;02&#34;].azurerm_monitor_diagnostic_setting.shared_integration_datafactory
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.adf.azure.com&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.database.windows.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.datafactory.azure.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dev.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.servicebus.windows.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.sql.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_resource_group.this[&#34;logic&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_resource_group.this[&#34;main&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.runtimes_datafactory_storage[&#34;xcutting&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;external&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;landing&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_role_assignment.shared_integration_datafactory_storage[&#34;xcutting&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;xcutting&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_management_policy.this[&#34;landing&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_storage_management_policy.this[&#34;xcutting&#34;]
  * module.data_landing_zone[&#34;02&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;02&#34;].azurerm_synapse_workspace_aad_admin.aad
  * module.data_landing_zone[&#34;02&#34;].random_password.synapse_sql_password
  * module.logic[&#34;02&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;02&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;02&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.logic[&#34;02&#34;].azurerm_role_assignment.storage
  * module.logic[&#34;02&#34;].azurerm_service_plan.this
  * module.logic[&#34;02&#34;].azurerm_storage_account.this
  * module.logic[&#34;02&#34;].azurerm_storage_account_network_rules.this
  * module.data_landing_zone[&#34;02&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;02&#34;].module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;02&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;02&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;02&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;02&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mssql.random_password.mssql_password[0]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;ingest02-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mysql.random_password.mysql_password[0]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-F5-VPN-Inbound&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow_SDS_PTL_ADO_Agents&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-eventhub&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-sql&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-storage&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-webapp&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-inbound&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-outbound&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_route.this[&#34;rt-rfc_1918_class_a&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_route.this[&#34;rt-rfc_1918_class_b&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_route.this[&#34;rt-rfc_1918_class_c&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest02landingsbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest02-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest02curatedsbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest02rawsbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest02xcuttingsbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest02-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest02-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest02-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest02-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;curated-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;curated-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;raw-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;raw-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;xcutting-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;xcutting-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;curated-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;curated-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;raw-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;raw-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;xcutting-blob&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;xcutting-dfs&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone[&#34;02&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
  * module.data_landing_zone[&#34;02&#34;].module.shir001.random_password.shir_password
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].azurerm_storage_container.container[&#34;landing&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;landing-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;landing-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;xcutting-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.storage_pe[&#34;xcutting-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;02&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_landing_zone[&#34;02&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator
  * module.logic[&#34;02&#34;].module.application_insights.azurerm_application_insights.this
  * module.logic[&#34;02&#34;].module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.data_landing_zone[&#34;02&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
  * module.data_landing_zone[&#34;02&#34;].module.shir001.module.shir_vmss.random_string.password
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-User-Owner-Isabella.O'Hara@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee04ad38-e56e-40e3-a998-40eb586c4c74"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-User-Owner-prasanna.krishnan@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f4fc64b1-7dac-4fe0-8271-f9734b79acfc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-User-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-logic-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-User-Owner-Isabella.O'Hara@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee04ad38-e56e-40e3-a998-40eb586c4c74"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-User-Owner-prasanna.krishnan@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f4fc64b1-7dac-4fe0-8271-f9734b79acfc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-User-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-main-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-User-Owner-Isabella.O'Hara@HMCTS.NET"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee04ad38-e56e-40e3-a998-40eb586c4c74"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-User-Owner-prasanna.krishnan@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f4fc64b1-7dac-4fe0-8271-f9734b79acfc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-User-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["02-ingest02-network-sbox-User-Storage-Blob-Data-Owner-qiang.zhou@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["02"].azurerm_data_factory_integration_runtime_self_hosted.this will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
      + data_factory_id             = (known after apply)
      + description                 = "Data Landing Zone - Self Hosted Integration Runtime running on ingest02-shir001"
      + id                          = (known after apply)
      + name                        = "ingest02-runtimes-dataFactory001-shir001"
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.data_landing_zone["02"].azurerm_eventhub_namespace.this will be created
  + resource "azurerm_eventhub_namespace" "this" {
      + auto_inflate_enabled                      = true
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + maximum_throughput_units                  = 2
      + minimum_tls_version                       = "1.2"
      + name                                      = "ingest02-integration-eventHubNamespace001-sbox"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

          + name                           = "ingest02xcuttingsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["02"].module.storage_pe["xcutting-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest02-xcutting-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest02-main-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest02xcuttingsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["02"].module.synapse_pe["dev"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest02-product-synapse001-dev-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest02-main-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest02-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dev",
            ]
        }
    }

  # module.data_landing_zone["02"].module.synapse_pe["sql"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest02-product-synapse001-sql-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest02-main-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest02-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sql",
            ]
        }
    }

  # module.data_landing_zone["02"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest02-product-synapse001-sqlOnDemand-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest02-main-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest02-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlOnDemand",
            ]
        }
    }

  # module.data_landing_zone["02"].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "ingest02-vnet-sbox-to-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name                    = "ingest02-network-sbox"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "ingest02-vnet-sbox"
    }

  # module.data_landing_zone["02"].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub-to-ingest02-vnet-sbox"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest02-vnet-sbox"
      + resource_group_name                    = "hmcts-hub-sbox-int"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "hmcts-hub-sbox-int"
    }

  # module.logic["02"].module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "data-landing-sbox"
      + resource_group_name                   = "ingest02-logic-sbox"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.logic["02"].module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - data-landing-sbox"
      + resource_group_name = "ingest02-logic-sbox"
      + scopes              = (known after apply)
      + tags                = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["02"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["02"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = true
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "ingest02-shir001-vmss-sbox"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "ingest02-main-sbox"
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + tags                                              = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Automatic"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + automatic_instance_repair (known after apply)

      + extension (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "ingest02-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "ingest02-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }

      + spot_restore (known after apply)

      + termination_notification (known after apply)
    }

  # module.data_landing_zone["02"].module.shir001.module.shir_vmss.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 301 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":87,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->